{
    "basics": {
        "name": "Yuma Uchida",
        "label": "Engineer × PM",
        "image": "https://wellness.uchida.link/images/profile.png",
        "email": "uchida.yuma@routeplus.co.jp",
        "url": "https://wellness.uchida.link",
        "summary": "Full-Stack Engineer and Project Manager with a track record of bridging technical execution and business strategy. Specialized in project recovery, team leadership, and scalable infrastructure design.",
        "location": {
            "city": "Tokyo",
            "countryCode": "JP",
            "region": "Japan"
        },
        "profiles": [
            {
                "network": "GitHub",
                "username": "uchidayuma",
                "url": "https://github.com/uchidayuma"
            }
        ]
    },
    "work": [
        {
            "name": "OR Lab Inc.",
            "position": "Tech Lead / Project Manager",
            "startDate": "2025-09",
            "endDate": "2025-12",
            "summary": "Development of a unified booking management and smart lock control tool for accommodations.",
            "highlights": [
                "Infrastructure as Code (IaC) with AWS CDK: Automated environment provisioning and ensured reproducibility, reducing deployment time by 50%.",
                "E2E Testing with Playwright: Introduced automated regression testing from scratch, significantly reducing manual QA costs and improving release confidence.",
                "Tech Lead for a multi-national team (Japan, Philippines, Vietnam): Led code reviews, architectural decisions, and facilitated English communication across borders."
            ]
        },
        {
            "name": "Rich Honeycomb Co.",
            "position": "Solo Developer",
            "startDate": "2025-06",
            "endDate": "2025-07",
            "summary": "Development of a suite of tools for an MEO (Map Engine Optimization) service provider.",
            "highlights": [
                "Developed multiple tools (sales list generator, competitor analysis, rank tracking) within a single month.",
                "End-to-end Solo Development: Handled everything from requirements definition and tech stack selection (Next.js, Supabase) to implementation, deployment, and client training.",
                "Leveraged Google Maps & Places APIs to achieve high-precision data collection at low cost."
            ]
        },
        {
            "name": "Company S (Medical)",
            "position": "PM / Lead",
            "startDate": "2024-01",
            "endDate": "2025-04",
            "summary": "New development and operation of a CRM (Patient Management System) and LINE Mini App for medical institutions.",
            "highlights": [
                "PM & Dev Lead for a 20-person team (Engineers, Designers, QA).",
                "Stakeholder Management: Aligned interests across Sales, CS, and Engineering departments, defining roadmaps and prioritization.",
                "Quality Improvement: Spearheaded the introduction of Playwright for automated testing to address quality degradation, working closely with the QA team to increase test coverage."
            ]
        },
        {
            "name": "Company S (Franchise)",
            "position": "Lead Engineer",
            "startDate": "2019-06",
            "endDate": "2024-02",
            "summary": "Development and maintenance of a core business system (Inventory, Estimation, Ordering, Construction Management) for a franchise headquarters and its franchisees.",
            "highlights": [
                "Digital Transformation: Centralized fragmented workflows (Excel/Paper) into a unified system, improving operational efficiency by approximately 30%.",
                "Major Upgrade: Executed a migration from Laravel 6 to 10, leading the refactoring of legacy code and reduction of technical debt.",
                "Cloud Migration: Designed and implemented the migration from on-premise to AWS (ECS Fargate) and built a CI/CD pipeline (CodePipeline) to accelerate deployment frequency."
            ]
        }
    ],
    "projects": [
        {
            "name": "AI Therapy Hub",
            "startDate": "2023-06",
            "endDate": "2024-12",
            "summary": "Personal Dev: AI Counseling App.",
            "highlights": [
                "ChatGPT API, React Native, Next.js",
                "Full lifecycle development"
            ]
        }
    ],
    "education": [],
    "awards": [
        {
            "title": "Udemy Best Seller Instructor",
            "date": "2024-01-01",
            "awarder": "Udemy",
            "summary": "Docker/K8s courses (25k+ students)"
        },
        {
            "title": "Impress Academy Lecturer",
            "date": "2020-06-01",
            "awarder": "Impress Academy",
            "summary": "Docker / Kubernetes Workshops"
        }
    ],
    "skills": [
        {
            "name": "Backend",
            "keywords": [
                "PHP (Laravel)",
                "Go",
                "Node.js",
                "Python"
            ]
        },
        {
            "name": "Frontend",
            "keywords": [
                "React",
                "Vue.js",
                "TypeScript",
                "Next.js"
            ]
        },
        {
            "name": "Infra",
            "keywords": [
                "AWS",
                "Docker",
                "ECS",
                "K8s",
                "Terraform/CDK"
            ]
        }
    ]
}